# -*- coding: utf-8  -*-
# -*- author: jokker -*-

"""
* markdown 语法总结
*
"""


"""

参考：https://www.runoob.com/markdown/md-paragraph.html

* 标题大小
    # 一级标题
    ## 二级标题
    ### 三级标题
    #### 四级标题
    ##### 五级标题
    ###### 六级标题

* 段落换行：使用两个以上空格加上回车

* 字体
    *斜体文本*
    _斜体文本_
    **粗体文本**
    __粗体文本__
    ***粗斜体文本***
    ___粗斜体文本___

* 分隔线 *** --- ___

    三个以上的星号、减号、底线来建立一个分隔线

* 删除线 ~~BAIDU.COM~~

* 下划线 <u>带下划线文本</u>

* 脚注
    创建脚注格式类似这样 [^RUNOOB]。
    [^RUNOOB]: 菜鸟教程 -- 学的不仅是技术，更是梦想！！！

"""










