# -*- coding: utf-8  -*-
# -*- author: jokker -*-


M_dict = {
    "M1":"杆塔类",
    "M2":"导地线类",
    "M3":"绝缘子类",
    "M4":"大尺寸金具类",
    "M5":"小尺寸金具类",
    "M6":"基础类",
    "M7":"通道环境类",
    "M8":"接地装置类",
    "M9":"附属设施类"
}

M_model_list ={
    "M1":["nc"],
    "M2":[],
    "M3":["jyzZB", "jyhQX"],
    "M4":["fzc","fzcRust","xjQX"],
    "M5":["kkxQuiting", "kkxTC"],
    "M6":[],
    "M7":[],
    "M8":[],
    "M9":[],
}

key_M_dict = {
    "塔头":["jyzZB", "jyhQX"],
    "塔身":["nc"],
    "塔号牌":["nc"],
    "杆号牌":["nc"],
    "塔基":["nc"],
    "导线端挂点":["jyzZB", "jyhQX","fzc", "fzcRust", "xjQX", "kkxQuiting", "kkxTC"],
    "导线挂点":["jyzZB", "jyhQX", "fzc", "fzcRust","xjQX", "kkxQuiting", "kkxTC"],
    "绝缘子":["jyzZB", "jyhQX", "fzc", "fzcRust","xjQX", "kkxQuiting", "kkxTC"],
    "横担端挂点":["jyzZB", "jyhQX", "fzc", "fzcRust","xjQX", "kkxQuiting", "kkxTC"],
    "地线":["fzc", "fzcRust","xjQX", "kkxQuiting", "kkxTC"],
    "导地线":["fzc", "fzcRust","xjQX", "kkxQuiting", "kkxTC"],
    "通道":["tongdao_none"],
    "塔全貌":["taquanmao_none"],
}

tag_code_dict = {

    # --------------------------------------------------------------------------------------------------------------
    # 开口销缺失
    "K": "040500013",

    # 开口销缺失
    "kkxTC": "040500023",

    # 安装不规范
    "illegal": "040500023",

    # 螺母松动，螺母安装不规范
    "clearence": "040501031",

    # 销钉锈蚀
    "K_KG_rust": "040500033",

    # 螺母锈蚀
    "Lm_rust": "040501013",

    # --------------------------------------------------------------------------------------------------------------

    # 鸟巢蜂巢
    "nc": "010000021",
    "fw": "010000021",

    # 玻璃绝缘子自爆
    "jyzzb": "030100023",

    # 绝缘子污秽
    "abnormal": "030100011",

    # 均压环倾斜
    "fail": "030200131",

    # 金具锈蚀
    "UGuaHuan_rust": "040201011",                               #U型挂环锈蚀
    "ZGuaBan_rust":"040202011",
    "ZBDGuaBan_rust":"040202011",                               #直角挂板锈蚀
    "WTGB_rust": "040203011",                                   #碗头挂板锈蚀
    "UBGuaBan_rust": "040205011",                               #球头挂环锈蚀
    "PGuaBan_rust": "040204011",
    "QYB_rust":"040204011",                                     #挂板锈蚀
    "Sanjiaoban_rust": "040210011",
    "LKLB_rust":"040210011",
    "LCLB_rust":"040210011",
    "LLLB_rust":"040210011",
    "LLB_rust":"040210011",                                     #联板锈蚀
    "DBTZB_rust": "040209011",
    "PTTZB_rust":"040209011",                                   #调整板锈蚀
    "Zhongchui_rust": "040302011",                              #重锤锈蚀


    # 防振锤锈蚀
    "fzc_rust": "040303031",

    # 防振锤破损
    "fzc_broken": "040303021",

    "sg": "040402011",

    # --------------------------------------------------------------------------------------------------------------
    # 吊塔
    "TowerCrane": "060800013",

    # 推土机
    "Bulldozer": "060800023",

    # 挖掘机
    "Digger": "060800033",

    "CementPumpTruck_yb": "060800033",
    # --------------------------------------------------------------------------------------------------------------

    # 线夹缺垫片
    "dp_missed": "040001042",

    # 线夹缺倾斜
    "XJfail": "040000071",

    # 防鸟刺安装不规范
    "fncBGF": "070400031",

    # 防鸟刺未打开
    "weidakai": "070400021",

    # jiedi
    "050000011": "050000011",
    "050001012": "050001012",

    # jichu
    "000000181": "000000051",
    "000000151": "000000151",
    "000000081": "000000081",
    "000000051": "000000051",
}
